// src/core/location/iranLocations.js
export const IRAN_LOCATIONS = [
    { 
        province: "آذربایجان شرقی", 
        cities: ["تبریز", "مراغه", "میانه", "مرند", "اهر", "بناب", "شبستر", "خداآفرین", "کلیبر", "هشترود", "سراب", "بستان‌آباد", "عجب‌شیر", "اسکو", "آذرشهر", "ملکان", "شاهین‌دژ", "هریس", "جلفا", "چاراویماق", "ورزقان", "تسوج", "صوفیان", "خسروشهر", "اسلام‌آباد", "قره‌آغاج", "شرفخانه", "سردرود", "باسمنج", "خامنه", "شندآباد"]
    },
    { 
        province: "آذربایجان غربی", 
        cities: ["ارومیه", "خوی", "میاندوآب", "بوکان", "مهاباد", "سلماس", "نقده", "پیرانشهر", "سردشت", "ماکو", "شاهین‌دژ", "تکاب", "اشنویه", "چالدران", "شوط", "پلدشت", "قره‌ضیاءالدین", "نوشین", "سرو", "گردکشانه", "بازرگان", "آواجیق", "ربط", "کشاورز", "نالوس", "مرگنلر", "سیلوانه", "کشکسرای"]
    },
    { 
        province: "اردبیل", 
        cities: ["اردبیل", "پارس‌آباد", "خلخال", "مشگین‌شهر", "گرمی", "نمین", "نیر", "سرعین", "بیله‌سوار", "اصلاندوز", "گیوی", "هیر", "لاهرود", "انگوت", "فیروزآباد", "کوراییم", "هشتجین", "کلور", "قصابه", "شاه‌آباد", "تازه‌کند", "رضی", "قره‌چمن", "قره‌قشلاق", "قره‌سو"]
    },
    { 
        province: "اصفهان", 
        cities: ["اصفهان", "کاشان", "نجف‌آباد", "خمینی‌شهر", "شاهین‌شهر", "فولادشهر", "فلاورجان", "نطنز", "اردستان", "نایین", "خور و بیابانک", "سمیرم", "شهرضا", "دهاقان", "گلپایگان", "خوانسار", "فریدن", "فریدون‌شهر", "چادگان", "مبارکه", "زرین‌شهر", "دولت‌آباد", "تیران", "کرون", "ورزنه", "حسن‌آباد", "کوهپایه", "جندق", "ابریشم", "میمه", "سگزی", "قهدریجان", "زواره", "انارک", "بیاضه", "خورزوق", "مشکات", "سده", "گرمسار", "آران و بیدگل", "کامو و چوگان", "ابوزیدآباد", "سفیدشهر", "نوش‌آباد", "نیاسر", "برزک", "جوشقان", "قمصر", "قهرود"]
    },
    { 
        province: "البرز", 
        cities: ["کرج", "هشتگرد", "طالقان", "نظرآباد", "اشتهارد", "فردیس", "ساوجبلاغ", "ماهدشت", "مشکین‌دشت", "گوهردشت", "کمال‌شهر", "محمدشهر", "آسارا", "کوهسار", "گرمدره", "شهر جدید هشتگرد", "شهر جدید پرند", "شهر جدید پردیس"]
    },
    { 
        province: "ایلام", 
        cities: ["ایلام", "دهلران", "آبدانان", "دره‌شهر", "مهران", "شیروان چرداول", "ملکشاهی", "بدره", "ایوان", "آسمان‌آباد", "ارکواز", "صالح‌آباد", "موسیان", "زرنه", "لومار", "میمه", "چوار", "سرابله", "بولی", "توحید"]
    },
    { 
        province: "بوشهر", 
        cities: ["بوشهر", "برازجان", "گناوه", "دیر", "کنگان", "جم", "عسلویه", "دالکی", "ریگ", "بندر گناوه", "بندر دیر", "بندر کنگان", "بندر ریگ", "بندر عسلویه", "بندر سیراف", "خورموج", "اهرم", "تنگستان", "دشتی"]
    },
    { 
        province: "تهران", 
        cities: ["تهران", "ری", "شمیرانات", "اسلام‌شهر", "قدس", "ورامین", "پاکدشت", "شهریار", "ملارد", "بهارستان", "قرچک", "پردیس", "پیشوا", "فیروزکوه", "دماوند", "شمیران", "شهرری", "بومهن", "فشم", "لواسان", "تجریش", "نیاوران", "سولقان", "کن", "سعادت‌آباد", "ونک", "قلهک", "دزاشیب", "جماران", "درکه", "فرحزاد", "حصارک", "سوهانک", "اوین", "جمشیدیه", "قیطریه"]
    },
    { 
        province: "چهارمحال و بختیاری", 
        cities: ["شهرکرد", "بروجن", "فارسان", "لردگان", "اردل", "سامان", "گندمان", "نقنه", "سفیددشت", "فرخ‌شهر", "هفشجان", "طاقانک", "دستنا", "چلگرد", "گهرو", "سردشت", "بازفت", "دوآب", "صمصامی", "دشتک", "سورشجان", "شلمزار"]
    },
    { 
        province: "خراسان جنوبی", 
        cities: ["بیرجند", "قائن", "فردوس", "طبس", "نهبندان", "درمیان", "سرایان", "بشرویه", "خوسف", "زیرکوه", "سربیشه"]
    },
    { 
        province: "خراسان رضوی", 
        cities: ["مشهد", "نیشابور", "سبزوار", "تربت حیدریه", "قوچان", "کاشمر", "تایباد", "خواف", "درگز", "چناران", "سرخس", "فریمان", "بردسکن", "جغتای", "داورزن", "فیروزه", "گناباد", "رشتخوار", "باخرز", "بجستان", "زاوه", "خلیل‌آباد", "کوهسرخ", "مه ولات", "تربت جام"]
    },
    { 
        province: "خراسان شمالی", 
        cities: ["بجنورد", "اسفراین", "شیروان", "آشخانه", "فاروج", "گرمه", "جاجرم"]
    },
    { 
        province: "خوزستان", 
        cities: ["اهواز", "آبادان", "خرمشهر", "دزفول", "ماهشهر", "اندیمشک", "بهبهان", "رامهرمز", "شوشتر", "شادگان", "گتوند", "لالی", "مسجدسلیمان", "هویزه", "بستان", "سوسنگرد", "حمیدیه", "هفتکل", "رامشیر", "بندر امام خمینی", "بندر ماهشهر"]
    },
    { 
        province: "زنجان", 
        cities: ["زنجان", "ابهر", "خدابنده", "ماهنشان", "قیدار", "خرمدره", "ایجرود", "سلطانیه"]
    },
    { 
        province: "سمنان", 
        cities: ["سمنان", "شاهرود", "دامغان", "گرمسار", "آرادان", "بسطام", "بیارجمند"]
    },
    { 
        province: "سیستان و بلوچستان", 
        cities: ["زاهدان", "چابهار", "خاش", "ایرانشهر", "زابل", "سراوان", "راسک", "کنارک", "سرباز", "نیک‌شهر", "قصرقند", "بمپور", "رودبار", "دلگان", "فنوج", "میرجاوه", "زهک", "هیرمند", "هامون", "نیمروز"]
    },
    { 
        province: "فارس", 
        cities: ["شیراز", "مرودشت", "کازرون", "جهرم", "فسا", "داراب", "لارستان", "لامرد", "گراش", "فراشبند", "قیر و کارزین", "مهر", "خنج", "اوز", "بیرم", "جویم", "خور", "خشت", "کوار", "سروستان", "خرامه", "ارسنجان", "استهبان", "نی‌ریز", "بوانات", "سپیدان", "اقلید", "آباده"]
    },
    { 
        province: "قزوین", 
        cities: ["قزوین", "البرز", "تاکستان", "آبیک", "بوئین‌زهرا", "محمودآباد", "آوج"]
    },
    { 
        province: "قم", 
        cities: ["قم", "جعفریه", "سلفچگان", "قنوات"]
    },
    { 
        province: "کردستان", 
        cities: ["سنندج", "مریوان", "بانه", "سقز", "قروه", "کامیاران", "دهگلان", "دیواندره", "سروآباد", "کرانی", "بیجار"]
    },
    { 
        province: "کرمان", 
        cities: ["کرمان", "رفسنجان", "سیرجان", "جیرفت", "بم", "زرند", "بافت", "بردسیر", "شهربابک", "راور", "کوهبنان", "منوجان", "عنبرآباد", "قلعه‌گنج", "رودبار", "کهنوج", "فاریاب", "ارزوییه", "انار"]
    },
    { 
        province: "کرمانشاه", 
        cities: ["کرمانشاه", "اسلام‌آباد غرب", "پاوه", "جوانرود", "هرسین", "کنگاور", "سنقر", "صحنه", "قصرشیرین"]
    },
    { 
        province: "کهگیلویه و بویراحمد", 
        cities: ["یاسوج", "گچساران", "دوگنبدان", "دهدشت", "لیکک", "چرام", "سی‌سخت", "پاتاوه"]
    },
    { 
        province: "گلستان", 
        cities: ["گرگان", "گنبد کاووس", "علی‌آباد", "کردکوی", "بندر ترکمن", "آق‌قلا", "کلاله", "مینودشت", "رامیان", "آزادشهر", "گمیشان"]
    },
    { 
        province: "گیلان", 
        cities: ["رشت", "انزلی", "لاهیجان", "لنگرود", "آستارا", "رودسر", "فومن", "صومعه‌سرا", "رودبار", "منجیل", "تالش", "ماسال", "شفت", "سیاهکل", "املش", "کلاچای", "چابکسر", "رحمت‌آباد", "خمام", "سنگر", "کوچصفهان", "لشت نشا", "بندر انزلی", "بندر کیاشهر", "بندر چمخاله", "بندر کپورچال", "بندر حسن‌کیاده"]
    },
    { 
        province: "لرستان", 
        cities: ["خرم‌آباد", "بروجرد", "دورود", "الیگودرز", "پل‌دختر", "کوهدشت", "ازنا", "نورآباد", "پلدختر"]
    },
    { 
        province: "مازندران", 
        cities: ["ساری", "بابل", "آمل", "قائم‌شهر", "نوشهر", "چالوس", "رامسر", "بهشهر", "تنکابن", "رودسر", "نکا", "جویبار", "فریدونکنار", "بابلسر", "محمودآباد", "کلاردشت", "عباس‌آباد"]
    },
    { 
        province: "مرکزی", 
        cities: ["اراک", "ساوه", "خمین", "دلیجان", "محلات", "شازند", "آشتیان", "تفرش", "فراهان", "کمیجان"]
    },
    { 
        province: "هرمزگان", 
        cities: ["بندرعباس", "قشم", "کیش", "بندر لنگه", "بندر خمیر", "بندر کنگ", "بندر جاسک", "بندر چارک", "بندر سیریک"]
    },
    { 
        province: "همدان", 
        cities: ["همدان", "ملایر", "تویسرکان", "نهاوند", "کبودرآهنگ", "اسدآباد", "رزن", "فامنین", "بهار"]
    },
    { 
        province: "یزد", 
        cities: ["یزد", "اردکان", "مهریز", "ابرکوه", "تفت", "میبد", "بافق"]
    }
];

export const getProvinces = () => IRAN_LOCATIONS.map(x => x.province);

export const getCitiesByProvince = (province) => {
    const item = IRAN_LOCATIONS.find(x => x.province === province);
    return item ? item.cities : [];
};
